vault/v7/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime; 
// startFrom       startTime;

startTime       0;

stopAt          endTime;
// stopAt          writeNow;

endTime         1.1;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

//Added for force output.
libs
(
    "libforces.so"
);

functions
{
    wing
    {
        patches             (wing);
        CofR                (0 0 0);
        outputControl       timeStep;
        outputInterval      50;
        type                forces;
        pName               p;
        UName               U;
        rhoName             rhoInf;
        rhoInf              1.18;
        log                 true;
    }
}



// ************************************************************************* //
